export const stations = [
  {
    id: 0,
    name: 'Библиотека им.Ленина',
    line_1: 'Сокольническая',
    color: 'sokol',
    link: './biblioteka_lenina.html'
  },
  {
    id: 1,
    name: 'Маяковская',
    line_1: 'Замоскворецкая',
    color: 'zamos',
    link: '/maykovskay.html'
  },
  {
    id: 2,
    name: 'Римская',
    line_1: 'Люблинско-дмитровская',
    color: 'lubli',
    link: '/rimskay.html'
  },
  {
    id: 3,
    name: 'Рижская',
    line_1: 'Калужско-Рижская',
    color: 'kalug',
    link: '/rizchskay.html'
  },
  {
    id: 4,
    name: 'Пыхтино',
    line_1: 'Калининская',
    color: 'solnc',
    link: '/pychtino.html'
  },
  {
    id: 5,
    name: 'Сокольники',
    line_1: 'Сокольническая',
    color: 'sokol',
    link: '/sokolniki.html'
  }
]

export const articles = [
  {
    id: 0,
    name: 'Подземные секреты',
    line_1: 'Архитектура ',
    line_2: '',
    line_3: '',
    color: 'arch',
    link: '/secrets.html',
    type: 'article'
  },
  {
    id: 1,
    name: 'Просто Тройка или что-то поинтереснее?',
    line_1: 'Технологии',
    line_2: '',
    line_3: '',
    color: 'tech',
    link: '/troika.html',
    type: 'article'
  },
  {
    id: 2,
    name: 'Метро в кино ',
    line_1: 'Искусство',
    line_2: 'История',
    line_3: '',
    color: 'art',
    link: '/cinema.html',
    type: 'article'
  },
  {
    id: 3,
    name: 'Лайфхаки при пересадках ',
    line_1: 'Лайфхаки',
    line_2: '',
    line_3: '',
    color: 'life',
    link: '/peresadki.html ',
    type: 'article'
  },
  {
    id: 4,
    name: 'Новые поезда Замоскво- рецкой',
    line_1: 'Инфоструктура',
    line_2: '',
    line_3: '',
    color: 'info',
    link: '/new_trains.html',
    type: 'news'
  },
  {
    id: 5,
    name: 'Нина Алешина – мать мтерополитена ',
    line_1: 'История',
    line_2: '',
    line_3: '',
    color: 'hist',
    link: '/nina.html ',
    type: 'article'
  },
  {
    id: 6,
    name: 'Что такое плывуны и чем они опасны для метро? ',
    line_1: 'Технологии',
    line_2: '',
    line_3: '',
    color: 'tech',
    link: '/swimmer.html ',
    type: 'article'
  },
  {
    id: 7,
    name: 'Нью Лук для салатовой ветки ',
    line_1: 'Технологии',
    line_2: '',
    line_3: '',
    color: 'tech',
    link: '/new_look.html',
    type: 'news'
  },
  {
    id: 8,
    name: 'Ваши дела закрыты!',
    line_1: 'Инфоструктура',
    line_2: '',
    line_3: '',
    color: 'info',
    link: '/dela.html ',
    type: 'news'
  },
  {
    id: 9,
    name: 'Научная конференция в метро',
    line_1: 'Технологии',
    line_2: '',
    line_3: '',
    color: 'tech',
    link: '/science.html',
    type: 'article'
  },
  {
    id: 10,
    name: 'Новый запахи в метро',
    line_1: 'Технологии',
    line_2: '',
    line_3: '',
    color: 'tech',
    link: '/zapach.html',
    type: 'article'
  },
  {
    id: 11,
    name: 'Открыто тестирование новой тройки',
    line_1: 'Технологии',
    line_2: '',
    line_3: '',
    color: 'tech',
    link: '/test_troika.html',
    type: 'news'
  }
]
export const chronology = [
  {
    id: 1,
    date: '1933',
    heading: 'Проект первоочередных линий',
    text_1:
      '13 августа 1933 года в президиум Моссовета был представлен технический проект первоочередных линий метрополитена. К концу года проект был утверждён, и подготовка к строительству начала набирать обороты. Этот документ определял маршруты и основные станции, которые будут построены в первую очередь.',
    text_2:
      'Работа над проектом велась быстро, чтобы как можно скорее начать строительство. Это требовало координации множества специалистов и значительных ресурсов. Несмотря на сложность задач, проект развивался по плану.',
    text_3:
      'Утверждение проекта было важным шагом к созданию метро. Оно позволило перейти от планирования к реальным строительным работам, которые должны были изменить облик Москвы.'
  },
  {
    id: 2,
    date: '1934',
    heading: 'Первый пробный поезд',
    text_1:
      '15 октября 1934 года на пусковом участке появился первый пробный поезд из двух вагонов. Испытания проводились на участке «Комсомольская» — «Сокольники». Это было важное событие, которое подтвердило готовность метрополитена к дальнейшему строительству.',
    text_2:
      'Испытания прошли успешно, что стало важным шагом к скорому запуску метро. Первый пробный поезд показал, что система работает и готова к эксплуатации. Этот этап был ключевым для дальнейшего развития проекта.',
    text_3:
      'Появление первого поезда стало символом прогресса и уверенности в успешной реализации проекта. Москвичи с нетерпением ждали, когда смогут воспользоваться новым видом транспорта.'
  },
  {
    id: 3,
    date: '1935',
    heading: 'Торжественное открытие',
    text_1:
      '14 мая 1935 года в Колонном зале Дома Союзов состоялось торжественное заседание, посвящённое пуску метрополитена. Это мероприятие собрало множество людей и стало символом нового этапа в жизни Москвы. Горожане с нетерпением ждали открытия первой линии метро.',
    text_2:
      'Заседание подчеркнуло значимость этого события для всей страны. Руководители города и страны выступили с речами, подчеркивая важность метро для Москвы. Это событие было широко освещено в прессе и вызвало большой интерес у общественности.',
    text_3:
      'Метро стало символом технического прогресса и модернизации города. Его открытие ожидали с большим нетерпением, и это событие стало важной вехой в истории Москвы.'
  },
  {
    id: 4,
    date: '1935',
    heading: 'Открытие первого участка',
    text_1:
      '15 мая 1935 года открылся первый участок Московского метрополитена для всеобщего пользования. В состав пускового участка длиной 11,2 км вошли 13 станций: «Сокольники», «Красносельская», «Комсомольская», «Красные Ворота», «Кировская» (ныне — «Чистые пруды»), «Дзержинская» (ныне — «Лубянка»), «Охотный Ряд», «Библиотека имени Ленина», «Дворец Советов» (ныне — «Кропоткинская»), «Парк культуры», «Улица Коминтерна» (ныне — «Александровский сад»), «Арбатская» и «Смоленская».',
    text_2:
      'Этот день стал важной вехой в истории города. Открытие метро значительно облегчило передвижение по Москве и улучшило транспортную инфраструктуру. Новые станции быстро стали популярными среди жителей города.',
    text_3: ''
  },
  {
    id: 5,
    date: '1935',
    heading: 'Проезд в метро',
    text_1:
      'В 1935 году стоимость проезда в метро устанавливалась в 50 копеек. Это была доступная цена, позволяющая многим москвичам воспользоваться новым видом транспорта. Стоимость проезда позволяла поддерживать метро в хорошем состоянии и развивать его дальше.',
    text_2:
      'Московское метро стало важной частью городской инфраструктуры. Низкая стоимость проезда сделала его доступным для большинства жителей города. Это способствовало быстрому росту популярности метро.',
    text_3:
      'Благодаря этому метро быстро стало основным видом транспорта для многих москвичей. Его удобство и доступность сделали его незаменимым в повседневной жизни горожан.'
  },
  {
    id: 6,
    date: '1935',
    heading: 'Первые поезда',
    text_1:
      'На первом участке Московского метрополитена в 1935 году работали поезда типа А из четырёх вагонов. Это были современные на тот момент поезда, обеспечивающие комфортное и быстрое передвижение по городу. Введение поездов типа А стало первым шагом к развитию обширной сети метро.',
    text_2:
      'Эти поезда стали основой для дальнейшего роста транспортной системы Москвы. Они были оснащены новейшими технологиями и обеспечивали высокий уровень комфорта для пассажиров. Появление таких поездов стало важным этапом в истории метрополитена.',
    text_3:
      'Поезда типа А быстро стали символом надежности и комфорта московского метро. Они обеспечили удобные и быстрые поездки для тысяч москвичей каждый день.'
  },
  {
    id: 7,
    date: '1936',
    heading: 'Увеличение состава поездов',
    text_1:
      'В 1936 году составы Московского метрополитена стали шестивагонными. Это позволило увеличить пассажиропоток и повысить удобство для горожан. Увеличение количества вагонов было важным шагом в развитии метро.',
    text_2:
      'Это решение улучшило качество обслуживания пассажиров и ускорило их передвижение по городу. Шестивагонные поезда стали новым стандартом для московского метро. Они обеспечивали большую вместимость и комфорт для пассажиров.',
    text_3:
      'Увеличение числа вагонов в поездах позволило лучше справляться с растущим потоком пассажиров. Это стало важным шагом к улучшению транспортной системы города и повышению её эффективности.'
  },
  {
    id: 8,
    date: '1937',
    heading: 'Открытие станции «Киевская»',
    text_1:
      '20 марта 1937 года открылась следующая за «Смоленской» станция Московского метрополитена — «Киевская». Перегон «Смоленская» — «Киевская» (ныне относящийся к Филёвской линии) имеет длину 1,3 км и пересекает реку Москву по мосту.',
    text_2:
      '«Киевская» стала первой станцией второй очереди метрополитена. Это открытие расширило возможности для пассажиров и улучшило транспортное сообщение в городе. Станция быстро стала одной из важных транспортных узлов Москвы.',
    text_3:
      'Перегон через реку Москву по мосту стал важным инженерным достижением. Он улучшил связь между разными частями города и сделал передвижение по Москве ещё более удобным.'
  },
  {
    id: 9,
    date: '1938',
    heading: 'Новые станции и линии',
    text_1:
      '13 марта 1938 года открылось движение по участку от «Улицы Коминтерна» до станции «Курская» длиной 2,3 км. Это позволило ликвидировать вилочное движение и организовать раздельное движение по двум радиусам — Кировско-Фрунзенскому и Арбатско-Покровскому.',
    text_2:
      'В этот же день открылась станция «Площадь Революции». Новые станции и линии значительно улучшили транспортную систему Москвы и сделали поездки по городу ещё удобнее. Открытие этих станций стало важным событием для жителей города.',
    text_3:
      'Раздельное движение по двум радиусам улучшило организацию транспортного потока. Это повысило эффективность метро и сделало его ещё более удобным для пассажиров. Новые станции быстро стали популярными и активно использовались москвичами.'
  }
]
