export const stations = [
  {
    id: 0,
    name: 'Библиотека им.Ленина',
    line_1: 'Сокольническая',
    line_2: '',
    line_3: '',
    color: 'sokol',
    link: '/'
  },
  {
    id: 1,
    name: 'Маяковская',
    line_1: 'Замоскворецкая',
    line_2: '',
    line_3: '',
    color: 'zamos',
    link: '/'
  },
  {
    id: 2,
    name: 'Римская',
    line_1: 'Люблинско-дмитровская',
    line_2: '',
    line_3: '',
    color: 'lubli',
    link: '/'
  },
  {
    id: 3,
    name: 'Площадь Революции',
    line_1: 'Арбатско-покровская',
    line_2: '',
    line_3: '',
    color: 'arbat',
    link: '/'
  },
  {
    id: 4,
    name: 'Третьяковская',
    line_1: 'Калужско-Рижская',
    line_2: 'Калининская',
    line_3: '',
    color: 'kalug',
    link: '/'
  },
  {
    id: 5,
    name: 'Павелецкая',
    line_1: 'Кольцевая',
    line_2: 'Замоскворецкая',
    line_3: '',
    color: 'kolic',
    link: '/'
  }
]
export const articles = [
  {
    id: 0,
    name: 'Некрасовка и рыбки',
    line_1: 'Искусство',
    line_2: '',
    line_3: '',
    color: 'art',
    link: '/',
    type: 'article'
  },
  {
    id: 1,
    name: 'Просто Тройка или что-то поинтереснее?',
    line_1: 'Технологии',
    line_2: '',
    line_3: '',
    color: 'tech',
    link: '/',
    type: 'article'
  },
  {
    id: 2,
    name: 'Древние находки в метро',
    line_1: 'Архитектура',
    line_2: 'История',
    line_3: '',
    color: 'arch',
    link: '/',
    type: 'article'
  },
  {
    id: 3,
    name: 'Метро в кино',
    line_1: 'Искусство',
    line_2: '',
    line_3: '',
    color: 'art',
    link: '/',
    type: 'article'
  },
  {
    id: 4,
    name: 'Новые поезда Замоскворецкой',
    line_1: 'Инфоструктура',
    line_2: '',
    line_3: '',
    color: 'info',
    link: '/',
    type: 'news'
  }
]
export const chronology = [
  {
    id: 0,
    date: '1935',
    heading: 'Эскалаторы',
    text_1:
      'Первоначальную дату открытие метро пришлось перенести из-за отсутствия эскалаторов. В то время эскалаторы работали только в Лондонском метро, их делали всего 2 компании в мире.',
    text_2:
      'Времени для своих разработок не хватало и пришлось закупить за колоссальную по тем временам сумму 200 000 золотых рублей один эскалатор. ',
    text_3:
      'Его разобрали и разработать эскалаторы советского производства. В рекордные сроки 6 февраля 1935 года первые эскалаторы успешно прошли испытания.'
  },
  {
    id: 1,
    date: '1935',
    heading: 'Первый айди',
    text_1:
      'Первоначальную дату открытие метро пришлось перенести из-за отсутствия эскалаторов. В то время эскалаторы работали только в Лондонском метро, их делали всего 2 компании в мире.',
    text_2:
      'Времени для своих разработок не хватало и пришлось закупить за колоссальную по тем временам сумму 200 000 золотых рублей один эскалатор.',
    text_3:
      'Его разобрали и разработать эскалаторы советского производства. В рекордные сроки 6 февраля 1935 года первые эскалаторы успешно прошли испытания.'
  },
  {
    id: 2,
    date: '1935',
    heading: 'Второй айди',
    text_1:
      'Первоначальную дату открытие метро пришлось перенести из-за отсутствия эскалаторов. В то время эскалаторы работали только в Лондонском метро, их делали всего 2 компании в мире.',
    text_2:
      'Времени для своих разработок не хватало и пришлось закупить за колоссальную по тем временам сумму 200 000 золотых рублей один эскалатор.',
    text_3:
      'Его разобрали и разработать эскалаторы советского производства. В рекордные сроки 6 февраля 1935 года первые эскалаторы успешно прошли испытания.'
  },
  {
    id: 3,
    date: '1935',
    heading: 'Третий айди',
    text_1:
      'Первоначальную дату открытие метро пришлось перенести из-за отсутствия эскалаторов. В то время эскалаторы работали только в Лондонском метро, их делали всего 2 компании в мире.',
    text_2:
      'Времени для своих разработок не хватало и пришлось закупить за колоссальную по тем временам сумму 200 000 золотых рублей один эскалатор.',
    text_3:
      'Его разобрали и разработать эскалаторы советского производства. В рекордные сроки 6 февраля 1935 года первые эскалаторы успешно прошли испытания.'
  }
]
