export const stations = [
  {
    id: 0,
    name: 'Библиотека им.Ленина',
    line_1: 'Сокольническая',
    color: 'sokol',
    link: './biblioteka_lenina.html'
  },
  {
    id: 1,
    name: 'Маяковская',
    line_1: 'Замоскворецкая',
    color: 'zamos',
    link: '/'
  },
  {
    id: 2,
    name: 'Римская',
    line_1: 'Люблинско-дмитровская',
    color: 'lubli',
    link: '/'
  },
  {
    id: 3,
    name: 'Площадь Революции',
    line_1: 'Арбатско-покровская',
    color: 'arbat',
    link: '/'
  },
  {
    id: 4,
    name: 'Третьяковская',
    line_1: 'Калужско-Рижская',
    color: 'kalug',
    link: '/'
  },
  {
    id: 5,
    name: 'Павелецкая',
    line_1: 'Кольцевая',
    color: 'kolic',
    link: '/'
  },
  {
    id: 6,
    name: 'Сокольники',
    line_1: 'Сокольническая',
    color: 'sokol',
    link: '/'
  }
]

export const articles = [
  {
    id: 0,
    name: 'Некрасовка и рыбки',
    line_1: 'Искусство',
    line_2: '',
    line_3: '',
    color: 'art',
    link: '/',
    type: 'article'
  },
  {
    id: 1,
    name: 'Просто Тройка или что-то поинтереснее?',
    line_1: 'Технологии',
    line_2: '',
    line_3: '',
    color: 'tech',
    link: '/',
    type: 'article'
  },
  {
    id: 2,
    name: 'Древние находки в метро',
    line_1: 'Архитектура',
    line_2: 'История',
    line_3: '',
    color: 'arch',
    link: '/',
    type: 'article'
  },
  {
    id: 3,
    name: 'Метро в кино',
    line_1: 'Искусство',
    line_2: '',
    line_3: '',
    color: 'art',
    link: '/',
    type: 'article'
  },
  {
    id: 4,
    name: 'Новые поезда Замоскворецкой',
    line_1: 'Инфоструктура',
    line_2: '',
    line_3: '',
    color: 'info',
    link: '/',
    type: 'news'
  }
]
export const chronology = [
  {
    id: 0,
    date: '1931',
    heading: 'Начало',
    text_1:
      '15 июня на пленуме ЦК ВКП(б) было принято решение о строительстве метрополитена в Москве. Это решение стало важным шагом в развитии столичной транспортной системы. Метро планировали создать, чтобы улучшить передвижение по городу и разгрузить наземный транспорт.',
    text_2:
      'Это был амбициозный проект, который обещал изменить жизнь миллионов москвичей. Построить метро в Москве означало радикально улучшить транспортную инфраструктуру и сделать город более удобным для жителей. ',
    text_3:
      'Работы по проектированию и строительству метро начались немедленно после принятия решения. Этот проект требовал больших усилий и инвестиций, но его реализация обещала огромные преимущества для города.'
  },
  {
    id: 1,
    date: '1933',
    heading: 'Проект первоочередных линий',
    text_1:
      '13 августа в президиум Моссовета был представлен технический проект первоочередных линий метрополитена. К концу года проект был утверждён, и подготовка к строительству начала набирать обороты. Этот документ определял маршруты и основные станции, которые будут построены в первую очередь.',
    text_2:
      'Работа над проектом велась быстро, чтобы как можно скорее начать строительство. Это требовало координации множества специалистов и значительных ресурсов. Несмотря на сложность задач, проект развивался по плану.',
    text_3:
      'Утверждение проекта было важным шагом к созданию метро. Оно позволило перейти от планирования к реальным строительным работам, которые должны были изменить облик Москвы.'
  },
  {
    id: 2,
    date: '1934',
    heading: 'Пробный поезд',
    text_1:
      '15 октября на пусковом участке появился первый пробный поезд из двух вагонов. Испытания проводились на участке «Комсомольская» — «Сокольники». Это было важное событие, которое подтвердило готовность метрополитена к дальнейшему строительству.',
    text_2:
      'Испытания прошли успешно, что стало важным шагом к скорому запуску метро. Первый пробный поезд показал, что система работает и готова к эксплуатации. Этот этап был ключевым для дальнейшего развития проекта.',
    text_3:
      'Появление первого поезда стало символом прогресса и уверенности в успешной реализации проекта. Москвичи с нетерпением ждали, когда смогут воспользоваться новым видом транспорта.'
  },
  {
    id: 3,
    date: '1935',
    heading: 'Торжественное открытие',
    text_1:
      '14 мая в Колонном зале Дома Союзов состоялось торжественное заседание, посвящённое пуску метрополитена. Это мероприятие собрало множество людей и стало символом нового этапа в жизни Москвы. Горожане с нетерпением ждали открытия первой линии метро.',
    text_2:
      'Заседание подчеркнуло значимость этого события для всей страны. Руководители города и страны выступили с речами, подчеркивая важность метро для Москвы. Это событие было широко освещено в прессе и вызвало большой интерес у общественности.',
    text_3:
      'Метро стало символом технического прогресса и модернизации города. Его открытие ожидали с большим нетерпением, и это событие стало важной вехой в истории Москвы.'
  },
  {
    id: 3,
    date: '1935',
    heading: 'Открытие первого участка',
    text_1:
      '15 мая открылся первый участок Московского метрополитена для всеобщего пользования. В состав пускового участка длиной 11,2 км вошли 13 станций: «Сокольники», «Красносельская», «Комсомольская», «Красные Ворота», «Кировская» (ныне — «Чистые пруды»), «Дзержинская» (ныне — «Лубянка»), «Охотный Ряд», «Библиотека имени Ленина», «Дворец Советов» (ныне — «Кропоткинская»), «Парк культуры», «Улица Коминтерна» (ныне — «Александровский сад»), «Арбатская» и «Смоленская».',
    text_2:
      'Этот день стал важной вехой в истории города. Открытие метро значительно облегчило передвижение по Москве и улучшило транспортную инфраструктуру. Новые станции быстро стали популярными среди жителей города.',
    text_3:
      'Метро открыло новые возможности для передвижения и значительно сократило время поездок по городу. Это был важный шаг к улучшению качества жизни в Москве и повышению её комфортабельности.'
  },
  {
    id: 3,
    date: '1935',
    heading: 'Первые поезда',
    text_1:
      'На первом участке Московского метрополитена работали поезда типа А из четырёх вагонов. Это были современные на тот момент поезда, обеспечивающие комфортное и быстрое передвижение по городу. Введение поездов типа А стало первым шагом к развитию обширной сети метро.',
    text_2:
      'Эти поезда стали основой для дальнейшего роста транспортной системы Москвы. Они были оснащены новейшими технологиями и обеспечивали высокий уровень комфорта для пассажиров. Появление таких поездов стало важным этапом в истории метрополитена.',
    text_3:
      'Поезда типа А быстро стали символом надежности и комфорта московского метро. Они обеспечили удобные и быстрые поездки для тысяч москвичей каждый день.'
  },
  {
    id: 3,
    date: '1936',
    heading: 'Увеличение состава поездов',
    text_1:
      'Составы Московского метрополитена стали шестивагонными. Это позволило увеличить пассажиропоток и повысить удобство для горожан. Увеличение количества вагонов было важным шагом в развитии метро.',
    text_2:
      'Это решение улучшило качество обслуживания пассажиров и ускорило их передвижение по городу. Шестивагонные поезда стали новым стандартом для московского метро. Они обеспечивали большую вместимость и комфорт для пассажиров.',
    text_3:
      'Увеличение числа вагонов в поездах позволило лучше справляться с растущим потоком пассажиров. Это стало важным шагом к улучшению транспортной системы города и повышению её эффективности'
  },
  {
    id: 3,
    date: '1935',
    heading: 'Торжественное открытие',
    text_1:
      '14 мая в Колонном зале Дома Союзов состоялось торжественное заседание, посвящённое пуску метрополитена. Это мероприятие собрало множество людей и стало символом нового этапа в жизни Москвы. Горожане с нетерпением ждали открытия первой линии метро.',
    text_2:
      'Заседание подчеркнуло значимость этого события для всей страны. Руководители города и страны выступили с речами, подчеркивая важность метро для Москвы. Это событие было широко освещено в прессе и вызвало большой интерес у общественности.',
    text_3:
      'Метро стало символом технического прогресса и модернизации города. Его открытие ожидали с большим нетерпением, и это событие стало важной вехой в истории Москвы.'
  },
  {
    id: 3,
    date: '1935',
    heading: 'Торжественное открытие',
    text_1:
      '14 мая в Колонном зале Дома Союзов состоялось торжественное заседание, посвящённое пуску метрополитена. Это мероприятие собрало множество людей и стало символом нового этапа в жизни Москвы. Горожане с нетерпением ждали открытия первой линии метро.',
    text_2:
      'Заседание подчеркнуло значимость этого события для всей страны. Руководители города и страны выступили с речами, подчеркивая важность метро для Москвы. Это событие было широко освещено в прессе и вызвало большой интерес у общественности.',
    text_3:
      'Метро стало символом технического прогресса и модернизации города. Его открытие ожидали с большим нетерпением, и это событие стало важной вехой в истории Москвы.'
  }
]
